OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic12f609.h
extern __at(0x001A) volatile __CMCON0bits_t CMCON0bits;

#define _C1CH                   0x01
#define _C1CH0                  0x01
#define _CMCH                   0x01
#define _C1R                    0x04
#define _CMR                    0x04
#define _C1POL                  0x10
#define _CMPOL                  0x10
#define _C1OE                   0x20
#define _CMOE                   0x20
#define _C1OUT                  0x40
#define _COUT                   0x40
#define _C1ON                   0x80
#define _CMON                   0x80

//==============================================================================


//==============================================================================
//        CMCON1 Bits

extern __at(0x001C) __sfr CMCON1;

typedef union
  {
  struct
    {
    unsigned C1SYNC             : 1;
    unsigned T1GSS              : 1;
    unsigned                    : 1;
    unsigned C1HYS              : 1;
    unsigned T1ACS              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CMSYNC             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CMHYS              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __CMCON1bits_t;

extern __at(0x001C) volatile __CMCON1bits_t CMCON1bits;

#define _C1SYNC                 0x01
#define _CMSYNC                 0x01
#define _T1GSS                  0x02
#define _C1HYS                  0x08
#define _CMHYS                  0x08
#define _T1ACS                  0x10

//==============================================================================


//==============================================================================
//        OPTION_REG Bits

extern __at(0x0081) __sfr OPTION_REG;

typedef union
  {
  struct
    {
    unsigned PS0                : 1;
    unsigned PS1                : 1;
    unsigned PS2                : 1;
    unsigned PSA                : 1;
    unsigned T0SE               : 1;
    unsigned T0CS               : 1;
    unsigned INTEDG             : 1;
    unsigned NOT_GPPU           : 1;
    };

  struct
    {
    unsigned PS                 : 3;
    unsigned                    : 5;
    };
  } __OPTION_REGbits_t;

extern __at(0x0081) volatile __OPTION_REGbits_t OPTION_REGbits;

#define _PS0                    0x01
#define _PS1                    0x02
#define _PS2                    0x04
#define _PSA                    0x08
#define _T0SE                   0x10
#define _T0CS                   0x20
#define _INTEDG                 0x40
#define _NOT_GPPU               0x80

//==============================================================================


//==============================================================================
//        TRISA Bits

extern __at(0x0085) __sfr TRISA;

typedef union
  {
  struct
    {
    unsigned TRISIO0            : 1;
    unsigned TRISIO1            : 1;
    unsigned TRISIO2            : 1;
    unsigned TRISIO3            : 1;
    unsigned TRISIO4            : 1;
    unsigned TRISIO5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned TRISA0             : 1;
    unsigned TRISA1             : 1;
    unsigned TRISA2             : 1;
    unsigned TRISA3             : 1;
    unsigned TRISA4             : 1;
    unsigned TRISA5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned TRISIO             : 6;
    unsigned                    : 2;
    };

  struct
    {
    unsigned TRISA              : 6;
    unsigned                    : 2;
    };
  } __TRISAbits_t;

extern __at(0x0085) volatile __TRISAbits_t TRISAbits;

#define _TRISIO0                0x01
#define _TRISA0                 0x01
#define _TRISIO1                0x02
#define _TRISA1                 0x02
#define _TRISIO2                0x04
#define _TRISA2                 0x04
#define _TRISIO3                0x08
#define _TRISA3                 0x08
#define _TRISIO4                0x10
#define _TRISA4                 0x10
#define _TRISIO5                0x20
#define _TRISA5                 0x20

//==============================================================================


//==============================================================================
//        TRISIO Bits

extern __at(0x0085) __sfr TRISIO;

typedef union
  {
  struct
    {
    unsigned TRISIO0            : 1;
    unsigned TRISIO1            : 1;
    unsigned TRISIO2            : 1;
    unsigned TRISIO3            : 1;
    unsigned TRISIO4            : 1;
    unsigned TRISIO5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned TRISA0             : 1;
    unsigned TRISA1             : 1;
    unsigned TRISA2             : 1;
    unsigned TRISA3             : 1;
    unsigned TRISA4             : 1;
    unsigned TRISA5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned TRISIO             : 6;
    unsigned                    : 2;
    };

  struct
    {
    unsigned TRISA              : 6;
    unsigned                    : 2;
    };
  } __TRISIObits_t;

extern __at(0x0085) volatile __TRISIObits_t TRISIObits;

#define _TRISIO_TRISIO0         0x01
#define _TRISIO_TRISA0          0x01
#define _TRISIO_TRISIO1         0x02
#define _TRISIO_TRISA1          0x02
#define _TRISIO_TRISIO2         0x04
#define _TRISIO_TRISA2          0x04
#define _TRISIO_TRISIO3         0x08
#define _TRISIO_TRISA3          0x08
#define _TRISIO_TRISIO4         0x10
#define _TRISIO_TRISA4          0x10
#define _TRISIO_TRISIO5         0x20
#define _TRISIO_TRISA5          0x20

//==============================================================================


//==============================================================================
//        PIE1 Bits

extern __at(0x008C) __sfr PIE1;

typedef union
  {
  struct
    {
    unsigned TMR1IE             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned C1IE               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T1IE               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CMIE               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PIE1bits_t;

extern __at(0x008C) volatile __PIE1bits_t PIE1bits;

#define _TMR1IE                 0x01
#define _T1IE                   0x01
#define _C1IE                   0x08
#define _CMIE                   0x08

//==============================================================================


//==============================================================================
//        PCON Bits

